import 'package:flutter/material.dart';

class AboutScreen extends StatelessWidget {
  const AboutScreen({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return  Scaffold(
      body: SingleChildScrollView(
        child: Padding(
          padding: const EdgeInsets.all(8.0),
          child: Column(
            children: [
              Container(
                height: 250,
                width: double.infinity,
                child: Image.asset("assets/A.png"),
              ),
              Text(
                "الصحة النفسية وتعديل السلوك تعتبر مبادرة مهمة للتخفيف من معاناة الأفراد ودعم صحتهم النفسية. تسعى المبادرة لتطوير الصحة النفسية وتقديم الدعم اللازم للأفراد والمجتمع للحد من تداعيات الأمراض النفسية.",
                style: TextStyle(fontSize: 15),
              ),
              SizedBox(
                height: 25,
              ),
              Text(
                "تهدف المبادرة أيضًا إلى تغيير الثقافة المحيطة بالصحة النفسية من خلال التوعية والبرامج المميزة، وتسعى لإزالة الوصم المتعلق بالأمراض النفسية. وتهدف أيضًا إلى زيادة مستوى الخدمات الصحية النفسية في مصر.",
                style: TextStyle(fontSize: 15),
              ),
              SizedBox(
                height: 25,
              ),
              Text(
                "تتمثل أهمية الصحة النفسية في زرع السعادة والاستقرار بين الأفراد وتمكينهم من التكامل، وتعزيز الاستقرار الذاتي والإيجابية. كما تؤثر الصحة النفسية في الاستقرار الأسري وتعزز قوة وتماسك المجتمع.",
                style: TextStyle(fontSize: 15),
              ),
              SizedBox(
                height: 25,
              ),
              Text(
                "وفقًا لمسح قومي أجرته وزارة الصحة المصرية، يعاني نحو 24.7% من المصريين من أعراض نفسية، و7% يعانون من اضطرابات نفسية. وكانت اضطرابات الاكتئاب هي الأكثر انتشارًا بنسبة 43.7%، تليها الاضطرابات الناجمة عن تعاطي المخدرات بنسبة 30.1%.",
                style: TextStyle(fontSize: 15),
              ),
              SizedBox(
                height: 25,
              ),
              Text(
                "تأثرت الصحة النفسية عالميًا بتفشي جائحة كورونا، حيث زادت معدلات القلق والاكتئاب في جميع أنحاء العالم. وقد أدت هذه التحديات إلى زيادة الوعي الفردي والمؤسسي بأهمية التعامل مع الصحة النفسية.",
                style: TextStyle(fontSize: 15),
              ),
              SizedBox(
                height: 25,
              ),
              Text(
                "للحد من نسب الانتحار والتغلب على المشاكل النفسية، يجب زيادة الوعي المجتمعي ونشر ثقافة الوقاية. يتعين على الأفراد الذين يشعرون باليأس أو يفكرون في الانتحار أن يكونوا على دراية بمكان الحصول على المساعدة وأن يتلقوا الدعم المناسب. وتعزز المبادرة الحالية الوعي المجتمعي وتقدم دعمًا ملائمًا للأسر المصرية.",
                style: TextStyle(fontSize: 15),
              ),
              SizedBox(
                height: 25,
              ),
              Text(
                "تشير منظمة الصحة العالمية إلى أن الاكتئاب سيكون المرض الأول في العالم بحلول عام 2030، وهذا يبرز أهمية المبادرات التي تهدف إلى تحسين الرعاية الصحية النفسية.",
                style: TextStyle(fontSize: 15),
              ),
              SizedBox(
                height: 25,
              ),
              Text(
                "لذا، تتطلب المبادرة تطوير القدرات والأدوات القياسية في مجال الأمراض النفسية، بالإضافة إلى تأهيل الكوادر البشرية وتحسين البنية التحتية للرعاية الصحية النفسية. وتشجع المبادرة التواصل المستمر وتقديم الدعم النفسي والسلوكي للمرضى والأشخاص المحيطين بهم.",
                style: TextStyle(fontSize: 15),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
